OpenFOAM-3.0.0/tutorials/compressible/rhoCentralFoam/obliqueShock/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    top
    {
        type            wall;
        nFaces          60;
        startFace       3510;
    }
    inlet
    {
        type            patch;
        nFaces          30;
        startFace       3570;
    }
    outlet
    {
        type            patch;
        nFaces          30;
        startFace       3600;
    }
    bottom
    {
        type            symmetryPlane;
        nFaces          60;
        startFace       3630;
    }
    frontAndBack
    {
        type            empty;
        nFaces          3600;
        startFace       3690;
    }
)

// ************************************************************************* //
